import React from 'react'
import Wrapper from '../components/Wrapper'
import { Card } from 'antd'

export default () => {
  return (
    <Wrapper>
      <div
        style={{
          display: 'flex',
          flexDirection: 'row',
          justifyContent: 'center'
        }}
      >
        <div>
          <Card
            style={{ width: 800 }}
            title="โรงเรียนจอมเวทย์"
            hoverable
            headStyle={{ fontSize: '2rem' }}
          >
            <p>
              ระบบการจัดตารางงานของโรงเรียนไม่มีประสิทธิภาพ
              ทำให้ครูนั้นต้องรับผิดชอบเอกสาร โครงงาน
              การประชุมอีกทั้งกิจกรรมมากมายจนทำให้เกิดการชนกันระหว่างงานที่ตนต้องรับผิดชอบ
              นอกจากนี้ในการสั่งงานบางครั้งก็สั่งแบบปากเปล่า
              ทำให้ไม่สามารถจดจำรายละเอียดของงานที่ได้รับมา
              หรือถึงจะสั่งมาทางข้อความแล้วพอจะกลับมาหาคำสั่งที่ได้รับก็ต้องเลื่อนหาไปเรื่อยๆ
              และในบางครั้งจำนวนงานที่ได้รับนั้นไม่มีความเหมาะสมและเท่าเทียม
              ครูบางคนได้รับงานที่มากเกินกว่าตัว
              แต่ครูบางคนได้รับงานเพียงงานสองงานหรือไม่ได้รับเลยก็มี
              <br />
              <br />
              เว็บไซต์นี้สร้างขึ้นบริหารจัดสรรไม่ให้เกิดการสั่งงานซ้อนทับกัน
              เพื่อทำให้งานที่สั่งมามีประสิทธิภาพมาก
              มีข้อมูลที่ชัดเจนว่าใครทำงานนี้
            </p>
          </Card>
        </div>
      </div>
    </Wrapper>
  )
}
